[
  "كليك هادا واح الفأر بغى يخطب واحد الفارة، ملي مشا عندهم  لدار قالت ليه أمها الا بغتي  نزوجك بنتي خاصك تكتب ليها القادوس بسميتها.",
  "واحد صاحبنا مشى للحمام عيط لواحد احكليه ضهرو قالو: راك عامر رد عليه صاحبنا شوية ديال لحديد اوصافي قالو لولد: اشمن حديد راك عامر بلوسخ .",
  "واحد الولد كان تابع وحد البنت شافوه خوتها وحكموا عليه يصبغ دارهم بشيتة الاسنان، داز من حداه واحد العايق كيضحك عليه، قالوا مالك كتضحك اصاحبي؟ قالوا الدار لكتصبغ بشيتة الاسنان أنا لي دربت ليها المرطوب بالمعلقة",
  "هادا واحد طاح فالدرجة ديال الباب  مشا عند الطبيب قلبوا وعطاه بومادا قالوا دهن البلاصة اللي طحتي عليها مشا هو مسكين دهن الدرجة",
  "هذا واحد الشفار دخل لواحد الدار ناوي يشفر ملي دخل لقا مرا او راجلها مزال فايقين قال للمرا: شنو سميتك قالت ليه: حليمة قال ليها: حليمة سميت الميمة العزيزة كوني هانية ماغانقيصكش هو يسول رجالها: أنت قاليه: سميتي بوعزة ولكن كيعيطو عليا حليمة",
  "واحد شفار دخل على واحد لمرا شويرفة و هو يسرق ليها التلفزيون ملي خرج من دار و هي تبعو شافها و خاف هو يهرب هي تتجري و هو تيجري هو هارب و هي تابعاه حتى عيا وقفت وهي تقولوا نسيتي تيليكوموند الزين",
  "سولوا واحد الطلابة: إيلا لقيتي 500 مليون، أشنو تديري بيها؟ قالت ليهم: نبني بيها جامع، نطلب قدامو غير بوحدي",
  "واحد الشلح قليه ولدو: لواليد عطيني 10 دراهم جاوبو الواليد : 5 دراهم ناس تيطلبو 4 دراهم ونتى باغي ربعين اش باغي درهم هاك 10 قسمها نتا اوخوك",
  "محشش يكره مدرس الفن قال له: المدرس ارسم حمار قال المحشش : حسنا لا تتحرك",
  "واحد الاستاذ سأل واحد التلميذ :  كتعرف حروف الهجاء قاليه : اه هو يقوليه الاستاذ : شنو مورا حرف الالف قاليه : جميع الحروف",
  "الاستاذ قال لواحد التلميذ: أعرب لنا جملة “ضرب الولد الصرصور” جاوب الولد: ضرب فعل إجرام، الطفل ابن حرام، أما الصرصور فهو مفعوص وعلامة فعصه الضربة القاضية على رأسه.",
  "مغربي تزوج و ليلة العرس قال للعروسة : اسمعي يا بنت الحلال قالت. تفضل ياحبيبي! قال لها : تعرفي بلي امك من فصيلة الأبقار انصدمت البنت وقالت: علاش كتقول على ماما هكذا قال لها: لانها جابت الزبدة اللي راهي قدامي",
  "فار غادي  سمع عرس دخل ليه لقا العرس ديال المشاش بات لعروسة شدو وقال لجوق: غنيو ليه يا زربان على عمرو .",
  "التلميذ المغربي ﻓﻘﻂ ﻣﻠﻲ ﻳﺠﻴﺐ ﻧﻘﻄﺔ ﻣﺰﻳﺎﻧﺔ ﻳﻘﻮﻟﻚ : ﻭ ﺍﻟﻠﻪ ﻣﺎﻋﺮﻓﺖ ﻛﻴﻔﺎﺵ ﺟﺒﺘﻬﺎ! ﻭﻣﻠﻲ ﻳﺠﻴﺐ ﺷﻲ ﻧﻘﻄﺔ ﻋﻴﺎﻧﺔ ﻳﻘﻮﻟﻚ : ﺟﺎﻭﺑﺖ ﻋﻠﻰ ﻛﻠﺸﻲ ﺻﺤﻴﺢ",
  "واحد الولد مكلخ قال لباباه: المعلم ديالنا غير كيخربق، البارح قال لينا خمسة تساوي جوج زائد ثلاثة، واليوم قال لينا خمسة تساوي واحد زائد أربعة",
  "هدا واحد الاستاذ سول واحد التلميذ : باش كتحلم ؟ قالو التلميذ: كنحلم نشد 10000 درهم بحال الواليد قالو الاستاذ: علاش الواليد ديالك كيشدهم؟ قال التلميذ: لا راه حتا هو بحالي كيحلم",
  "ﻫﺎﺩﻭ مجموعة ﺩﻳﺎﻝ ﺍﻟﻤﻜﻠﺨﻴﻦ فيﺍﻟﺠﺎﻣﻌﺔ ﻛﻴﻜﺘﺒﻮﺍ ﺩﺍﻛﺸﻲ لي ﻛﻴﻜﺘب ﺍﻷﺳﺘﺎذ في ﺍﻟﺴﺒﻮﺭﺓ ﻣﻨﻴﻦ ﻛﻴﻤﺴﺢ ﺍﻷﺳﺘاذ ﺍﻟﺴﺒﻮﺭﺓ، ﻛﻴﻘﻄﻌﻮﺍ ﻫﻮﻣﺎ ﺍﻟﻮﺭﻗﺔ",
  "استاذ لغة عربية انتحر، فالتحقيق عرفو أن واحد من التلاميذ سولو : واش الضمير المتصل جاوبو شي حد وﻻ باقي تيتاصل ؟",
  "أستاذ الرياضيات سال التلميذ اذا اعطاك ابوك 15 دراهم و اعطا لآخوك 20 درهم ماذا تساوي اجاب التلميذ: تساوي مطايفة",
  "خدمت في البني باش ننساك أ حليمة وليت كنشوف وجهك في خناشي السيمة",
  "المبوق سولو واحد : علاش العريس كيلبس كومبلي كحل، والعروسة كتلبس كسوة بيضة؟ قال ليهم: حيت المرا كتضوي للراجل حياتو، والراجل كيحل على مهاعيشتها .",
  "شرطي وقف واحد خطاف تاع لبلايص وقال له منين محمل هاد الناس؟ الخطاف دار فيها عايق قال للشرطي محملهم من بلاي ستور سيمانة و الخطاف يطلب في الشرطي باش ينزل ليه السيارة من الديباناج و هو يقول ليه الشرطي صبر شوية راه الكونيكسيون ضعيفة.",
  "واحد الكبش سمع العيد قريب مشايشري كتاب  كيف تصبح حماراً في خمسة أيام من دون معلم",
  "واحد دا المدام لسنيما  وقال ليها :شنو بغيتي تاكلي ؟ الزريعة ولا شي حاجة باردة؟ قالت ليه : بزوج وهو يجيب ليها دلاحة",
  "واحد الحمق سولو صاحبو خوتك اش سميتهم  قال ليهم كلهم سميتهم سمحمد الا فيصل سميتو خالد",
  "اذا خانك من تحب فلا تحزن أبدا بل انتظر قليلا حتى يعطيك بظهره شير عليه بحجرة و دردك لداركم",
  "باركولي اليوم كملت نص ديني مول الحانوت كان يتسالني 400درهم وعطيتو 200درهم",
  "وحدة راجلها كيتحشش قاتلوا اعطيني بغيت حتى أنا نجرب. شافيها وصاط عليها جوج صوطات. بدات تبكي قالها مالك قاتلوا كاع صحاباتي تزوجوا بقيت غير أنا",
  "أصعب إحساس ملي تيكونو رجيلاتك مجمدين بالبرد و كاتنوض من بلاستك باش تلبس تقاشر و كايضربك السداري لصبعك",
  "ﻣﺤﺸﺶ ﻣﺎﺕ ليه ﺑﺎﻩ ﻭ ﺑﺪﺍ ﻛﻴﺒﻜﻲ ﻋﻠﻴﻪ ﺷﻮﻳﺔ ﺟﺎﻩ ﺗﻠﻴﻔﻮﻥ ﻛﻤﻞ ﺍﻟﻤﻜﺎﻟﻤﺔ ﺑﺪﺍ ﻛﻴﺒﻜﻲ ﺑﺠﻬﺪ ﻛﺘﺮ ﻣﻦ الأول ﺍﻟﻨﺎﺱ ﺗﺨﻠﻌﺖ ﻋﻠﻴﻪ ﻭ ﻗﺎﻟﻮ ﻟﻴﻪ ﻣﺎﻟﻚ ؟ ﺷﻜﻮﻥ ﻟﻲ ﻛﺎﻥ ﻳﻬﺪﺭ ﻣﻌﺎﻙ ؟ ﻗﺎﻝ ﻟﻴﻬﻢ  ﺧﺘﻲ ﺣﺘﻰ ﻫﻲ ﻣﺴﻜﻴﻨﺔ ﻣﺎﺕ ﻟﻴﻬﺎ ﺑﺎﻫﺎ",
  "رجل عمره 80 سنة يهدر مع الدكتور و هو فرحان ،أنا زوجتي عمرها 20 سنة حامل واش رايك يا دكتور ؟ رد الدكتور: غادي نحكيلك قصة زوينة هذا واحد الصياد مشا الغابة باش يصيد نمر و نسى البندقية تاعه و أخذ مكانها مظلة مشا للغابة وشاف النمر خرج مظلة و تيرا في النمر وقع ومات رد الشيخ : مستحيل يا دكتور لازم فيه واحد اخر تيرا على النمر رد الدكتور: هانتا فهمتي",
  "قالك هادا واحد كان غادي في الزنقة هو يسمع واحد الراجل كي قول لمرتو :ماذا ترين في عيني يا فتيحة قالت له أرى الحب يا عزيزي، هو يمشي عند مرتو قاليها مادا ترين في عينيي يا نعيمة  قالت له العمش ها محمد العمش.",
  "واحد الاستاذ كتب للتلاميذ حرف النون او قاليهم ما هذا الحرف يا أطفال تا واحد ما عرف و واحد الكسول قاليهم زلافة  فوق منها حمصة أ استاذ",
  "واحد حول متزوج بوحدة بحالو حولة قال ليها مني تشوفيني جاي بوحدي ماتحطي  والو  ولكن  غير تشوفي معايا شيء راجل حطي طعام مراتو شافتو من بعد جاي بانو ليها 2 رجال حيت هي حولة وهي تحط طعام دخل بدا ياكل معاها واحد لوقيته قال ليها بشوية كون ماكنتي بوحدك كون سلخت يماك مسكين حتى هو شاف حداها وحدة",
  "واحد النهار  الدجاجة انتحرت و كتبات في الوصية ديالها: إيوا شبعوا بضامة البنة البشر",
  "لحناش تابعين واحد الحشايشي خسرات بيهم صطافيط  هما يركبو طموبيل ديال كنور  شدوا الحشايشي  وهو بدا كيضحاك قالو ليه مال جدك كضحك قال ليهم شفت كنور بالدجاج و بالحوت غير معمرني ماشفتو بالحناش .",
  "واحد شرى بارابول بالتخبيعة على عائلتو، قال لهم حتى واحد ما يطلع للسطح حيت شريت كلب كبير وجاعر بزاف، شوية طلع واحد من عائلتو يستكشف المكان، من بعد نزل من السطح وهو مخلوع  ويرجف من الخوف، سولوهالعائلة مالك: شفت الكلب؟  قلهم لا: شفت غير الطبسيل لي كياكل فيه",
  "واحد خونا تنفس حذا واحد الشيباني، حشم من الشيباني وبغا يشوف واش عاق بيه ولا لا قاليه: كيف داير السمع عندك الحاج ؟ قالو الشيباني : اللي مايسمعش يشم يا ولد الكلب",
  "واحد ادخل سكران للامتحان عطاوه سؤال : شكون قريب للارض واش القمر ولا أستراليا؟ جاوبهم : القمر . حيت كنشوفو أما أسنراليا مكنشوفوهاش",
  "قاليك هذا واحد سكران داز فالضوء الحمر هو يوقفو لبوليسي قاليه اسي راك دزتي في الضوء لحمر قاليه السكران ومشي شي حمورية الشاف",
  "قاليك هاذ واحد هو و صحبتو غادين كايتسراو فدروبا أو حشمانين بقاو ساكتين طريق كاملة واحد شوية قاليها قولي لي شي كلمة حلوة وهي تقول ليه سكر قاليها لا شيحاجا تجمعنا بجوج قاتليه سطافيط",
  "قالك هادو جوج دخلو القهوة الاول طلب من كارسون كاس ديال العصير فوقو ليمونة والثاني طلب كاس حليب فوقو بقرة",
  "هدا واحد لفقيه كيعلم الولاد الصغار القران لجاتو العطسة اش نقول ليه و قالو رحمك الله قاليهم مرة اخرى صفقوا و قولوا رحمك الله وحد المرة طاح فالبير و بداو كجبدوه بلحبل و عطس الفقيه طلقوا الحبل و طاح وصفقوا و قالولوا رحمك الله",
  "هاداواحد خونا مشى لعند مول الحانوت باش يشري من عندو الحليب، وخونا زعما بغى يعيق على مول الحانوت وهو يقول ليه: الله يخليك، عطيني واحد ليترو ديال العصير ديال البقر",
  "هادو واحد الجوج سكرانين كاو وبغاو يشعلو كارو وخاصهوم بريكا قال واحد فيهوم هاني غانمشي نشوف شي واحد، دار دويرا وارجع عند صاحبو قاليه واش عندك شي بريكة أخويا قاليه لاخور يلاه سيفت واحد يجيبها بلاتي نتسناوه وبقاو كايتسناو.",
  "هادا واحد دخل لحديقة الحيوانات وهو يدخّل عند السبع فلقفز ديالو ، الحارس جا كايجري وقاليه: وا تا أشنو كاتدير ألمسطي ؟؟؟؟ قاليه : وا غير بشوية أصحبي تا مالنا غادي ناكلوه..",
  "الألمان سمحوا للمغاربة بالهجرة بلا وراق. المغاربة كلهم يستعدوا للهجرة. الملك هو يخطب عليهم وقال: آخر واحد يخرج من المغرب يطفي معاه الضو ويسد الما.",
  "ﻗﺎﻟﻴﻚ ﻫﺎﺩﻱ ﻭﺍﺣﺪ دريا ﻋﺎﻡ ﻣﺎ ﻣﺸﺎﺕ ﻟﺤﻤﺎﻡ وﻧﻬﺎﺭ مشات ﻟﻴﻪ ﻗﻠﺒﻮ ﻟﻴﻬﺎ ﺷﻌﺮﻫﺎ ﻟﻘﺎﻭ فيه ﻟﻘﻤﻞ ﻛﻴﺼﻠﻲ ﺻﻼﺓ ﺍﻻﺳﺘﺴﻘﺎء",
  "ﻭﺍﺣﺪ خونا عيط لمرتو ﻭﻗﺎﻝ ﻟﻴﻬﺎ : ﻭﺟدي ﻟﻴﺎ ﺍﻟﻤﺎ ﺍﻟﺴﺨﻮﻥ ﻗﺎﻝ ﻟﻴﻪ ﺻﺎﺣﺒﻮ : نتا كاين نتا راجل أصاحبي ﻗﺎﻝ ﻟﻴﻪ ﺍﻟﺮﺍﺟﻞ: مالك ﺷﻨﻮ ﺑﻐﻴﺘﻲ؟ ﻧﻐﺴﻞ ﺍﻟﻤﺎﻋﻦ ﺑﻤﺎ ﺑﺎﺭﺩ؟",
  "ﻭﺍﺣﺪ خونا ﺳﻮّﻝ ﻣﺮﺗﻮ: ﺷﺤﺎﻝ دابا وحنا مزوجين؟ ﺟﺎﻭﺑﺎﺗﻮ: 38 ﻋﺎﻡ كال ﻟﻴﻬﺎ : ﻛﻮﻥ قتلتك ﻛﻮﻥ ﺩﺍﺑﺎ خرجت ﻣﻦ ﺍﻟﺤبس",
  "ﺳﻮﻟﻮ ﻭﺍﺣﺪ خونا محشش : ﺇﻳﻼ ﻛﺎﻥ ﺍﻟﺘﺪﺧﻴﻦ ﻣﺤﺮﻡ، ﺃﺵ ﻳﻜﻮﻥ ﺍﻟﺤﺸﻴﺶ ؟؟ ﻗﺎﻝ ﻟﻴﻬﻮﻡ : ﺍﺣﺘﻤﺎﻝ ﻳﻜﻮﻥ ﺫﻭالحجة",
  "هدا واحد خونا شرى حوتا كبيرة. الزوجة: ياع الحوتة خانزة الزوج: علاه نتي عايمة فحالها.",
  "ما الفرق بين الحبل القصير واللباس القصير …..؟ الحبل القصير يجر حمار واحد واللباس القصير يجر 100 حمار وراه",
  "حارس عام كان مسافر راكبا حافلة فنام ولما فاق لقى الكريسون قدامو كيقول ليه ” ارى الورقة ” فقالو الحارس العام ” سير جيب باك ”",
  "واحد المرأة كاتعاود لصاحبتها: ناري أختي هاد جارنا أش تايدير للڭ‍ارو قالو لي حتى ولدك كايكمي هي ترد عليها: ولدي أنا ماشي هبيل ماتايكمي الڭ‍ارو حتى كايحلو و ينقيه عاد يجمعو و يكميه",
  "امرأة سولات جارتها ما السبب في نعومة يديك ؟ فأجابتها ، أنا استعمل نعمان في غسل الأواني و التصبين فقالت المرأة : وفين تايتباع هذا المسحوق؟ فقالت الجارة: نعمان هو سميت راجلي",
  "محشش عينوه حارس مسجد وبنفس اليوم جراو عليه علاش؟ كل ما يجي وقت الصلاة كيسد المسجد و يكتب على الباب” مغلق للصلاة”",
  "طفل سئل أمه : ماما علاش تتقولي على خويا ملاك ؟ قالت ليه : لانه صغير ودايما الأطفال الصغار ملايكة وعلاش تتسول؟ قالها : حيت لحتو من السطح وماطارش",
  "محشش بعت صورتو لخطيبتو وهو راكب حمار و كتب ملاحظة “أنا يللي فوق”!",
  "هدا واحد الفار فاق مقطوع في رمضان او هو يعربط على الحيوانات في الغابة اوملي عيا طلع فوق واحد الشجرة او هو ينعس او ملي فاق من النعاس لقى واحد المش كيدور تحت الشجرة او هو يقول ولاد الحرام ديكلاراو بيا",
  "هاذي أم هشام الكروج شرات الحولي في العيد …هو يهرب ليها ! و هي تعيط هشام هو يرجع الحولي قاليها غير كنضحك معاك الحاجة",
  "هادوا زوج محششين واحد سول لاخر قاليه انت فين تزدتي قاليه في سبيطار اهو يقول ليه ياك لاباس مالك كنتي مريض ?",
  "دخل سجين جديد الى السجن فقال له مدير نتاع السجن : هدا سجن نمودجي …… كنسمحو للسجين باش يمارس العمل الي كان كيدير برا ……… شنو المهنة اللي كنتي كتمارسها خارج السجن قاله : عساس نتاع الباب",
  "واحد البايرة لقات واحد الشيباني ناعس حدا واحد المزبلة وهي تهزو وتنفضو من الغبرة وقالت. حرام عليكم هدا يتلاح",
  "واحد الولد سول باه: كيفاش نعرف واش الواحد سكران؟ قال ليه باه: السكران أولدي غادي يقول ليه راه هادوك ربعة د الشجرات ماشي جوج منين تلفت الولد فين شير باه وهي تبان ليه غير شجرة وحدة",
  "دري بغا يمشي من طنجة عايم حيت غير 14 كلم... ضرب 7 كلم...عيا هوا يرجع",
  "حشايشي تابعنو لحناش .. كيدخل ليهم من دروبا مشدوهش.. واحد لوقت شافوه راجع قال ليهم دراري انا عييت ليوم تاغدا ونكملو",
  "واحد حل لبلاكار.. لقا حوايجو معلقين.. هوا يتبعهم",
  "واحد بغا يدور لحريرة... داها لمدينة",
  "واحد شرا صباط كبير عليه.. هوا يحتارموا",
  "واحد كيكتب نقز السطر.. هوا يتهرس",
  "واحدا قالت لراجلها نصوب لك مصمن ولا بعرير.. قال ليها صوبي فمك هوا الاول",
  "واحد خارج من دارهم .. كايسب فالملك... لوالدة ديالو تابعاه كاتغوت: وديال سبانيا",
  "واحد مشا سكران لدارهم... مراتو لاحت ليه ساروت.. تلف على الثقبة ديال الباب... غوت عليها قال ليها لحتي الساروت ولوحي الثقبة",
  "قالك شلح نجح ولدوا شرا ليه بالون قال ليه الا نجحتي لعام جاي نفخها ليك",
  "قواس كاتفرج فماتش . مشا يشرب تسجل هدف بلا مايشوفو مني دارو الاعادة ماتماركاش",
  "قسم كسالى رسمات ليهم استادة ديال الرياضيات مثلت سولاتهم اش هوا هدا واحد لكاسول قال ليها درهم حرشا",
  "هدا راجل شرا حولي قبل من لعيد بعام ولفو عليه مالين دار. مني قرب العيد مشا لحولي عند الراجل فال ليه بابا امتا هاتجيت لحولي",
  "شلح حاط فالمحل قدام لاكيس مرايا...باش مني يهز لفلوس يتأكد انو هو مشي واحد أخر",
  "واحد حشايشي شاف باه فالزنقة.. باه جا عندو قال ليه ماك مشفتنيش.. قال ليه شفتك غير معرفت فين",
  "واحد كتب ليه طبيب دوا.. قال ليه شربو ورا القهوة.. صاحبنا مشا لورا واحد القهوة فالدرب شربها",
  "دري كايبغي درية سميتها نزهة... مشا عند باها قال ليه عمي بغيت نزهة ....قال ليه زها على مك",
  "جحش كبر مشا كيجري عند مو قال ليها ماما وليت حمار.. قالت ليه مالك كنتي مهندس",
  "واحد مشا عند طبيب قال ليه فيا لحناش فكرشي... الطبيب محشش قال ليه كتب فيها الامن الوطني",
  "واحد قال لباه عطيني درهم ندور... قال ليه هاك درهم وسير نيشان",
  "هذا واحد لعزي وعزية ولدو بيض سماوه مايمكنش",
  "هذا صلع و صلعة ولدو دري عندو زغبة وحدة سماوه لمشعكك",
  "هادا واحد سميتو مبارك او جارتو سميتها زهرة مبارك شرا حولي هي تقوليه جارتو مبارك الحولي كال ليها تبارك الله على زهرة البقرة",
  "معكاز واحد النهار مراتو كدق الباب نسات الساروت مفيه مينوض قال ليها سيري لدار باك راك مطلقة",
  "واحد بايت بالجوع حلم راسو كياكل لملاوي فاق لقا راسو صارط كاشا",
  "راجل معقول غادي وطاح فحفرة ناض منها وشاف حفرة قدامو قال اف عوتاني هنطيج",
  "واحد شرا طموبيل ودارها طاكسي غادي بيها الناس كيقولو ليه طاكسي طاكسي وكيقول ليههم عرفتو طاكسي عرفتو",
  "واحد قالت لراجلها حلمت البارح شريتي ليا لبسة واعرة وقال ليها اليوم حلمي راسك لابساها",
  "واحد ديما كيهز شي حاجة من دارهم واحد النهار شفر بورطابل ديال خوه تاصلو بيه من الدار قالو ليه رد البورطابل وقال ليهم نتوما اي حاجة تمشي لصقوها فيا",
  "واحد قال لمو بغيت تزوج بوحدة بيضاء وطويلة وخدامة.. قالت خد لك حسن ثلاجة",
  "واحد معكازبزااف ... قال لصاحبو : دبرت على خدمة. قال له مبروك فين ؟؟ قالو فمطبعه...كانكلس فوق الوراق باش مايطيروش",
  "هدا واحد البخيل فاق في صباح بكري ومشا يحل الحانوت ملي حلو لقاه مسروق وهو يسدو ورجع نعس وغطى راسو بالمانطا أو قال الله إخرج هاد الحلمة على خير",
  "عروبي شرا بورطابل.. دارو فجيبو.. واحد الوقت بدا يفيبري... لاحو.. قال ولد الحرام باعو ليا حي ..",
  "هذا محماد الشلح مول الحانوتة , لقى ولدو تيشوف في شامبوان...وهو يصلع ليه",
  "هدا واحد الراجل مخاصم لا يتكلم مع الزوجة ديالو. كتب ليها: غدا فيقيني مع 6 صباحا...لكن ما فاق حتى 12 ...وهو يلقاها كتبا ليه : فيق راه 6 صباحا"
]